dotfiles/spacemacs.d/config.org
#+TITLE: Spacemacs config
#+Author: Pierre Springer
* Clock
** Clock history
   #+BEGIN_SRC emacs-lisp
     (setq org-clock-history-length 95)
   #+END_SRC
** Resume clock when starting the clock twice
   #+BEGIN_SRC emacs-lisp
     (setq org-clock-in-resume t)
   #+END_SRC
** Show tasks with active clocks in clock report
   #+BEGIN_SRC emacs-lisp
     (setq org-clock-report-include-clocking-task t)
   #+END_SRC
** Remove logbook entries with duration 0
   #+BEGIN_SRC emacs-lisp
     (setq org-clock-out-remove-zero-time-clocks t)
   #+END_SRC
** Clock out after setting state to DONE
   #+BEGIN_SRC emacs-lisp
     (setq org-clock-out-when-done t)
   #+END_SRC
** Show active task in bottom bar
   #+BEGIN_SRC emacs-lisp
     (setq mode-line-org-clock t)
     (spacemacs/toggle-mode-line-org-clock-on)
   #+END_SRC
** Log change to done
   #+BEGIN_SRC emacs-lisp
     (setq org-log-done 'time)
   #+END_SRC
** Use pretty formating for clocktables
   #+BEGIN_SRC emacs-lisp
     (setq org-pretty-entities t)
   #+END_SRC
** Resume clock when emacs is restarted
   #+BEGIN_SRC emacs-lisp
     (org-clock-persistence-insinuate)
   #+END_SRC
** Define formation and options of clock summary
   #+BEGIN_SRC emacs-lisp
     (setq org-columns-default-format "%50ITEM(Task) %2PRIORITY %10Effort(Effort){:} %10CLOCKSUM")
     ;; Agenda log mode items to display (closed and state changes by default)
     (setq org-agenda-log-mode-items (quote (closed state)))
     ;; Agenda clock report parameters
     (setq org-agenda-clockreport-parameter-plist
           (quote (:link t :maxlevel 5 :fileskip0 t :compact t :narrow 80)))
    (add-hook 'org-agenda-mode-hook '(lambda () (hl-line-mode 1 )))
    (add-hook 'kill-emacs-hook #'org-clock-out)
   #+END_SRC

* Org
** General settings
*** Autosave all org buffers
    #+BEGIN_SRC emacs-lisp
      (add-hook 'auto-save-hook 'org-save-all-org-buffers)
    #+END_SRC
*** Show images in org buffers
    #+BEGIN_SRC emacs-lisp
      (setq org-display-inline-images t)
      (setq org-startup-with-inline-images t)
    #+END_SRC
*** Load org-protocol
    Actually I forgot why to do that
    #+BEGIN_SRC emacs-lisp :tangle yes
      (server-start)
      (require 'org-protocol)
      (with-eval-after-load 'org
        (add-to-list 'org-modules 'org-protocol))
    #+END_SRC
*** Use clock report with agenda and archives
    Clock report in agenda normally only looks at agenda files. I would like to use archives, too.
    #+BEGIN_SRC emacs-lisp
      (setq org-clock-clocktable-default-properties '(:scope agenda-with-archives))
      (setq org-clocktable-defaults '(:scope agenda-with-archives))
    #+END_SRC

** Tags
*** Predefine some often used tags
    #+BEGIN_SRC emacs-lisp
      (setq org-tag-alist (quote ((:startgroup)
                                  ("@uni" . ?u)
                                  ("@hainsfarth" . ?h)
                                  ("@garching" . ?g)
                                  ("@muenchen" . ?m)
                                  (:endgroup)
                                  ("WAITING" . ?w)
                                  ("PERSONAL" . ?P)
                                  ("WORK" . ?W)
                                  ("ORG" . ?O)
                                  ("NOTE" . ?n)
                                  ("habit" .?h)
                                  ("CANCELLED" . ?c)
                                  ("FLAGGED" . ??))))
    #+END_SRC
*** Allow tags to be set with hotkey
    #+BEGIN_SRC emacs-lisp
      (setq org-fast-tag-selection-single-key (quote expert))
    #+END_SRC
** Org agenda
*** Define standard org files
    #+BEGIN_SRC emacs-lisp
      (setq org-agenda-files'(
                              "~/calendar.org"
                              "~/Projekte/org/uni_cal.org"
                              "~/Projekte/org/tasks.org"
                              "~/org/"
                              ))
    #+END_SRC
*** Give inactive tag to archived todos
    #+BEGIN_SRC emacs-lisp
      (setq org-archive-tag "inactive")
    #+END_SRC
*** Make tag and todo search follow ignore commands
    #+BEGIN_SRC emacs-lisp
      ;(setq org-agenda-tags-todo-honor-ignore-options t)
    #+END_SRC
*** Start week on monday
    #+BEGIN_SRC emacs-lisp
      (setq org-agenda-start-on-weekday 1)
    #+END_SRC
*** Start agenda in day mode
    #+BEGIN_SRC emacs-lisp
      (setq org-agenda-span 1)
    #+END_SRC
*** Set filters for agenda
    #+BEGIN_SRC emacs-lisp
      (setq org-agenda-skip-scheduled-if-done t)
      (setq org-agenda-skip-deadline-if-done t)
      (setq org-agenda-filter-preset '("-someday"))
      ; Only show one recurring task
      (setq org-agenda-show-future-repeats 'next)
      ; Hide dependent tasks (thanks to nathbo!)
      (setq org-agenda-dim-blocked-tasks 'invisible)
    #+END_SRC
*** Set formating
    #+BEGIN_SRC emacs-lisp
      (setq org-agenda-fontify-priorities
            (quote ((65 (:foreground "Red")) (66 (:foreground "Blue")) (67 (:foreground "Darkgreen")))))
      (setq org-agenda-date-weekend (quote (:foreground "Yellow" :weight bold)))
    #+END_SRC
*** Define custom agenda filters
    #+BEGIN_SRC emacs-lisp
      (setq org-agenda-custom-commands
            ;; (append org-agenda-custom-commands
            '(("g" . "GTD-Workflow")
              ("gw" "Upcoming week" agenda ""
               ((org-agenda-span 'week)
                (org-agenda-filter-preset '("-habit"))
                (org-agenda-view-columns-initially t)
                ))
              ("gr" "Review past week" agenda
               ((org-agenda-span 'week)
                (org-agenda-skip-scheduled-if-done nil)
                (org-agenda-log-mode)
                ))

              ("n" "Next Actions"
               ((todo "TODO"
                      ((org-agenda-filter-preset '("-someday"))
                       (org-agenda-todo-ignore-scheduled t)
                       (org-deadline-warning-days 90)))
                (tags-todo "habit")
                (agenda ""
                        ((org-agenda-entry-types '(:deadline))
                         (org-agenda-span 1)
                         (org-deadline-warning-days 90)
                         (org-agenda-time-grid nil)
                         (org-agenda-overriding-header "Upcoming Deadlines")
                         ))
                ))

              ;; Special types
              ("s" "Someday" tags "someday"
               ((org-agenda-filter-preset '("+someday"))
                (org-use-tag-inheritance nil)
                (org-agenda-todo-ignore-with-date nil)))

              ;; Contexts
              ("h" "@Home"
               ((tags "@HOME"
                      ((org-agenda-todo-ignore-with-date nil)))
                ))
              ("u" "@Uni"
               ((tags "@UNI"
                      ((org-agenda-todo-ignore-with-date nil)))
                ))
              ("m" "master" tags "masterthesis"
               ((org-agenda-todo-ignore-with-date nil))
               )

              ("d" "Upcoming deadlines" agenda ""
               ((org-agenda-entry-types '(:deadline))
                (org-agenda-span 1)
                (org-deadline-warning-days 120)
                (org-agenda-overriding-header "Upcoming Deadlines")
                (org-agenda-time-grid nil)))

              )
            )

    #+END_SRC
** Org captures
   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq org-capture-templates
           '(("t" "Aufgabe in tasks.org" entry (file+headline "~/Projekte/org/tasks.org" "Inbox")
              "* TODO %?\n%U\n%a\n" :clock-in t :clock-resume t)
             ("m" "Aufgabe aus Mail" entry (file+headline "~/Projekte/org/tasks.org" "Inbox")
              "* TODO %? , Link: %a")
             ("c" "Cookbook" entry (file "~/org/cookbook.org")
              "%(org-chef-get-recipe-from-url)" :empty-lines 1)
             ("p" "Phone call" entry (file "~/Projekte/org/tasks.org" "Inbox")
              "* PHONE %? :PHONE:\n%U" :clock-in t :clock-resume t)
             ("g" "Add normal entry to google calendar" entry
              (file "~/calendar.org")
              "* %?
      %^T" :empty-lines 1 :empty-lines-after 1 :time-prompt t)

             ("m" "Masterarbeit")
             ("mq" "Masterarbeit: Question" entry (file+headline "~/org/mt_general.org" "Open Questions")
              "- %?")
             ("mt" "Masterarbeit: ToDo" entry (file+headline "~/org/mt_general.org" "Todo")
              "* TODO %?")
             ("mg" "Masterarbeit: General" entry (file+olp "~/org/mt_general.org" "General")
              "* %?")
             ))
   #+END_SRC
** Org Todo
*** Set todo keywords
    #+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
      (quote ((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
              (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING"))))
    #+END_SRC
*** Use triggers on todo states
    Defines order to cycle through states
    #+BEGIN_SRC emacs-lisp
      (setq org-todo-state-tags-triggers
            (quote (("CANCELLED" ("CANCELLED" . t))
                    ("WAITING" ("WAITING" . t))
                    ("HOLD" ("WAITING") ("HOLD" . t))
                    (done ("WAITING") ("HOLD"))
                    ("TODO" ("WAITING") ("CANCELLED") ("HOLD"))
                    ("NEXT" ("WAITING") ("CANCELLED") ("HOLD"))
                    ("DONE" ("WAITING") ("CANCELLED") ("HOLD")))))
    #+END_SRC
*** Active order for todos
    Thanks to nathbo!
    #+BEGIN_SRC emacs-lisp
      (setq org-enforce-:todo-dependencies t)
    #+END_SRC:
