dotfiles/spacemacs.d/config.el
(server-start)
(require 'org-protocol)
(with-eval-after-load 'org
  (add-to-list 'org-modules 'org-protocol))

(setq org-tag-alist (quote ((:startgroup)
                            ("@uni" . ?u)
                            ("@hainsfarth" . ?h)
                            ("@garching" . ?g)
                            ("@muenchen" . ?m)
                            (:endgroup)
                            ("WAITING" . ?w)
                            ("PERSONAL" . ?P)
                            ("WORK" . ?W)
                            ("ORG" . ?O)
                            ("NOTE" . ?n)
                            ("habit" .?h)
                            ("CANCELLED" . ?c)
                            ("FLAGGED" . ??))))

(setq org-fast-tag-selection-single-key (quote expert))

(setq org-agenda-files'(
                        "~/calendar.org"
                        "~/Projekte/org/uni_cal.org"
                        "~/Projekte/org/tasks.org"
                        "~/org/"
                        ))

(setq org-archive-tag "inactive")

;(setq org-agenda-tags-todo-honor-ignore-options t)

(setq org-agenda-start-on-weekday 1)

(setq org-agenda-span 1)

(setq org-agenda-skip-scheduled-if-done t)
(setq org-agenda-skip-deadline-if-done t)
(setq org-agenda-filter-preset '("-someday"))
; Only show one recurring task
(setq org-agenda-show-future-repeats 'next)
; Hide dependent tasks (thanks to nathbo!)
(setq org-agenda-dim-blocked-tasks 'invisible)

(setq org-agenda-fontify-priorities
      (quote ((65 (:foreground "Red")) (66 (:foreground "Blue")) (67 (:foreground "Darkgreen")))))
(setq org-agenda-date-weekend (quote (:foreground "Yellow" :weight bold)))

(setq org-agenda-custom-commands
      ;; (append org-agenda-custom-commands
      '(("g" . "GTD-Workflow")
        ("gw" "Upcoming week" agenda ""
         ((org-agenda-span 'week)
          (org-agenda-filter-preset '("-habit"))
          (org-agenda-view-columns-initially t)
          ))
        ("gr" "Review past week" agenda
         ((org-agenda-span 'week)
          (org-agenda-skip-scheduled-if-done nil)
          (org-agenda-log-mode)
          ))

        ("n" "Next Actions"
         ((todo "TODO"
                ((org-agenda-filter-preset '("-someday"))
                 (org-agenda-todo-ignore-scheduled t)
                 (org-deadline-warning-days 90)))
          (tags-todo "habit")
          (agenda ""
                  ((org-agenda-entry-types '(:deadline))
                   (org-agenda-span 1)
                   (org-deadline-warning-days 90)
                   (org-agenda-time-grid nil)
                   (org-agenda-overriding-header "Upcoming Deadlines")
                   ))
          ))

        ;; Special types
        ("s" "Someday" tags "someday"
         ((org-agenda-filter-preset '("+someday"))
          (org-use-tag-inheritance nil)
          (org-agenda-todo-ignore-with-date nil)))

        ;; Contexts
        ("h" "@Home"
         ((tags "@HOME"
                ((org-agenda-todo-ignore-with-date nil)))
          ))
        ("u" "@Uni"
         ((tags "@UNI"
                ((org-agenda-todo-ignore-with-date nil)))
          ))
        ("m" "master" tags "masterthesis"
         ((org-agenda-todo-ignore-with-date nil))
         )

        ("d" "Upcoming deadlines" agenda ""
         ((org-agenda-entry-types '(:deadline))
          (org-agenda-span 1)
          (org-deadline-warning-days 120)
          (org-agenda-overriding-header "Upcoming Deadlines")
          (org-agenda-time-grid nil)))

        )
      )

(setq org-capture-templates
      '(("t" "Aufgabe in tasks.org" entry (file+headline "~/Projekte/org/tasks.org" "Inbox")
         "* TODO %?\n%U\n%a\n" :clock-in t :clock-resume t)
        ("m" "Aufgabe aus Mail" entry (file+headline "~/Projekte/org/tasks.org" "Inbox")
         "* TODO %? , Link: %a")
        ("c" "Cookbook" entry (file "~/org/cookbook.org")
         "%(org-chef-get-recipe-from-url)" :empty-lines 1)
        ("p" "Phone call" entry (file "~/Projekte/org/tasks.org" "Inbox")
         "* PHONE %? :PHONE:\n%U" :clock-in t :clock-resume t)
        ("g" "Add normal entry to google calendar" entry
         (file "~/calendar.org")
         "* %?
 %^T" :empty-lines 1 :empty-lines-after 1 :time-prompt t)

        ("m" "Masterarbeit")
        ("mq" "Masterarbeit: Question" entry (file+headline "~/org/mt_general.org" "Open Questions")
         "- %?")
        ("mt" "Masterarbeit: ToDo" entry (file+headline "~/org/mt_general.org" "Todo")
         "* TODO %?")
        ("mg" "Masterarbeit: General" entry (file+olp "~/org/mt_general.org" "General")
         "* %?")
        ))

(setq org-todo-keywords
      (quote ((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
              (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING"))))

(setq org-todo-state-tags-triggers
      (quote (("CANCELLED" ("CANCELLED" . t))
              ("WAITING" ("WAITING" . t))
              ("HOLD" ("WAITING") ("HOLD" . t))
              (done ("WAITING") ("HOLD"))
              ("TODO" ("WAITING") ("CANCELLED") ("HOLD"))
              ("NEXT" ("WAITING") ("CANCELLED") ("HOLD"))
              ("DONE" ("WAITING") ("CANCELLED") ("HOLD")))))
