dotfiles/spacemacs.d/config.org
*** Comment on CTRL-SHIFT-C
    #+BEGIN_SRC emacs-lisp
      (global-set-key (kbd "C-S-c") 'evil-commentary-line)
    #+END_SRC
*** Neotree on F1
    Also use all-my-icons for neotree
    #+BEGIN_SRC emacs-lisp
      (define-key global-map (kbd "<f1>") 'neotree)
      (setq neo-theme 'icons)
    #+END_SRC
*** Yay Snippet completion on ALT-J
    #+BEGIN_SRC emacs-lisp
      (global-set-key "\M-j" 'hippie-expand)
    #+END_SRC
*** Interleave / Bibtex hotkeys
    #+BEGIN_SRC emacs-lisp
      (evil-leader/set-key-for-mode 'org-mode "I" 'interleave-mode)
      (evil-leader/set-key-for-mode 'org-mode "B" 'helm-bibtex)
      (evil-leader/set-key-for-mode 'bibtex-mode "B" 'helm-bibtex)
    #+END_SRC
*** Set org meta return on Alt-Return + Alt-Retrun
    Used to add branches on trees
    #+BEGIN_SRC emacs-lisp
      (with-eval-after-load 'org
        (evil-define-key '(normal insert) org-mode-map (kbd "M-RET M-RET") 'org-meta-return))
    #+END_SRC
*** Clock in and out on F5 and F8
    #+BEGIN_SRC emacs-lisp
      (fset 'my-clock-in "\C-c\C-x\C-i")
      (global-set-key (kbd "<f5>") 'my-clock-in)

      (fset 'my-clock-out "\C-c\C-x\C-o")
      (global-set-key (kbd "<f8>") 'my-clock-out)
    #+END_SRC
*** Set CTRL s for saving all buffers
    #+BEGIN_SRC emacs-lisp
      (defun save-all () (interactive) (save-some-buffers t))
      (global-set-key (kbd "C-s") 'save-all)
    #+END_SRC
** Use Libnotify for alerts
   #+BEGIN_SRC emacs-lisp
     (setq alert-default-style 'libnotify)
   #+END_SRC

** Fit PDF on display resolution
   #+BEGIN_SRC emacs-lisp
     (setq-default pdf-view-display-size 'fit-page)
   #+END_SRC

** Syncing with google calendar
*** Load google authentication files
    #+BEGIN_SRC emacs-lisp
    (setq org-gcal-file-alist '(("pspri99@gmail.com" . "~/calendar.org")
                            ("h8raedgh2c8hoa7fk49v8aogmc0ldbda@import.calendar.google.com" . "~/Projekte/org/uni_cal.org")
                                ))

      (defun read-lines (filePath)
        "Return a list of lines of a file at filePath."
        (with-temp-buffer
          (insert-file-contents filePath)
          (split-string (buffer-string) "\n" t)))
      (setq auth-lines (read-lines "~/gcal.auth"))
      (setq org-gcal-client-id (car auth-lines)
           org-gcal-client-secret (car (cdr auth-lines)))
    #+END_SRC

*** Hook to capture to sync with google
    #+BEGIN_SRC emacs-lisp
      (add-hook 'org-capture-after-finalize-hook 'google-calendar/sync-cal-after-capture)
    #+END_SRC
** General visual manipulations
*** Scroll margin
    #+BEGIN_SRC emacs-lisp
      (setq scroll-margin 5)
    #+END_SRC

*** Truncate lines when too large (120 char)
    #+BEGIN_SRC emacs-lisp
      (spacemacs/toggle-truncate-lines-on)
    #+END_SRC

*** Visual line navigation
    #+BEGIN_SRC emacs-lisp
      (add-hook 'text-mode-hook 'spacemacs/toggle-visual-line-navigation-on)
    #+END_SRC
** Set CUA mode to use ctrl-v/s/x
   #+BEGIN_SRC emacs-lisp
     (cua-mode 1)
   #+END_SRC
** Set coordinates of hometown for agenda-sunset
   #+BEGIN_SRC emacs-lisp
     (setq calendar-location-name "Munich, Germany")
     (setq calendar-latitude 48.248872)
     (setq calendar-longitude 11.653248)
   #+END_SRC
** Geolocation and timed theme
   press space, a, w to show weather forecast
   #+BEGIN_SRC emacs-lisp
     (setq sunshine-appid "4fba292d761a7cb80a8aec91fd6d522b")
     (setq sunshine-location "85748,DE")
     (setq sunshine-units 'metric)
     (setq sunshine-show-icons t)

   #+END_SRC

** Undo Tree-Fix
   To use undo tree with spacemacs it is recommended to hook that with desktop saving.
   Thanks to [[https://github.com/syl20bnr/spacemacs/issues/774][Spacemacs Github]]
   Usage: [[https://emacs.stackexchange.com/questions/27339/how-to-operate-the-undo-redo-tree-in-spacemacs][Stackexchange]]

   #+BEGIN_SRC emacs-lisp
      (setq
      desktop-dirname             "~/.emacs.d/session/"
      desktop-path                (list desktop-dirname)
      desktop-auto-save-timeout 5
      desktop-restore-eager 5) ;; lazily restore desktop buffers
     (desktop-save-mode 1)

     ;; add before `desktop-read' hook
     (defvar desktop-before-read-hook '() "Hooks run before `desktop-read'.")
     (defadvice desktop-read (before my:desktop-read-run-before-hooks activate)
       (run-hooks 'desktop-before-read-hook))
     (setq undo-tree-auto-save-history t)
     (defun my:enable-global-undo-tree()
       (global-undo-tree-mode 1)
       (diminish 'undo-tree-mode))
     (add-hook 'desktop-before-read-hook 'my:enable-global-undo-tree)
   #+END_SRC
** Load org habit
   For some reason org-habit only works, when loaded here...
   #+BEGIN_SRC emacs-lisp
     (add-to-list 'org-modules 'org-habit)
   #+END_SRC
** Use fine undo
   Emacs normally undos the whole block when using insert mode. Make it more granular
   #+BEGIN_SRC emacs-lisp
     (setq evil-want-fine-undo t)
   #+END_SRC
** Add sphinx doc key for python mode
   Adds sphinx docstring with space i d
   #+BEGIN_SRC emacs-lisp
     (spacemacs/set-leader-keys-for-major-mode 'python-mode "id" 'sphinx-doc)
     (spacemacs|use-package-add-hook python
       :post-config
       (spacemacs/set-leader-keys-for-major-mode 'python-mode
         "id" 'sphinx-doc))
   #+END_SRC
