dotfiles/spacemacs.d/config.el

(global-set-key (kbd "C-S-c") 'evil-commentary-line)

(define-key global-map (kbd "<f1>") 'neotree)
(setq neo-theme 'icons)

(global-set-key "\M-j" 'hippie-expand)

(evil-leader/set-key-for-mode 'org-mode "I" 'interleave-mode)
(evil-leader/set-key-for-mode 'org-mode "B" 'helm-bibtex)
(evil-leader/set-key-for-mode 'bibtex-mode "B" 'helm-bibtex)

(with-eval-after-load 'org
  (evil-define-key '(normal insert) org-mode-map (kbd "M-RET M-RET") 'org-meta-return))

(fset 'my-clock-in "\C-c\C-x\C-i")
(global-set-key (kbd "<f5>") 'my-clock-in)

(fset 'my-clock-out "\C-c\C-x\C-o")
(global-set-key (kbd "<f8>") 'my-clock-out)

(defun save-all () (interactive) (save-some-buffers t))
(global-set-key (kbd "C-s") 'save-all)

(setq alert-default-style 'libnotify)

(setq-default pdf-view-display-size 'fit-page)

(setq org-gcal-file-alist '(("pspri99@gmail.com" . "~/calendar.org")
                        ("h8raedgh2c8hoa7fk49v8aogmc0ldbda@import.calendar.google.com" . "~/Projekte/org/uni_cal.org")
                            ))

  (defun read-lines (filePath)
    "Return a list of lines of a file at filePath."
    (with-temp-buffer
      (insert-file-contents filePath)
      (split-string (buffer-string) "\n" t)))
  (setq auth-lines (read-lines "~/gcal.auth"))
  (setq org-gcal-client-id (car auth-lines)
       org-gcal-client-secret (car (cdr auth-lines)))

(add-hook 'org-capture-after-finalize-hook 'google-calendar/sync-cal-after-capture)

(setq scroll-margin 5)

(spacemacs/toggle-truncate-lines-on)

(add-hook 'text-mode-hook 'spacemacs/toggle-visual-line-navigation-on)

(cua-mode 1)

(setq calendar-location-name "Munich, Germany")
(setq calendar-latitude 48.248872)
(setq calendar-longitude 11.653248)

(setq sunshine-appid "4fba292d761a7cb80a8aec91fd6d522b")
(setq sunshine-location "85748,DE")
(setq sunshine-units 'metric)
(setq sunshine-show-icons t)

(setq
 desktop-dirname             "~/.emacs.d/session/"
 desktop-path                (list desktop-dirname)
 desktop-auto-save-timeout 5
 desktop-restore-eager 5) ;; lazily restore desktop buffers
(desktop-save-mode 1)

;; add before `desktop-read' hook
(defvar desktop-before-read-hook '() "Hooks run before `desktop-read'.")
(defadvice desktop-read (before my:desktop-read-run-before-hooks activate)
  (run-hooks 'desktop-before-read-hook))
(setq undo-tree-auto-save-history t)
(defun my:enable-global-undo-tree()
  (global-undo-tree-mode 1)
  (diminish 'undo-tree-mode))
(add-hook 'desktop-before-read-hook 'my:enable-global-undo-tree)

(add-to-list 'org-modules 'org-habit)

(setq evil-want-fine-undo t)
